app/Controllers/Admin.php

SELECT *
FROM `admin`
WHERE `username` = 'mamasteng'
 LIMIT 1
---
    public function index()
    {
        $AdminLogin = new \App\Models\AdminModel();
        $admin = $this->request->getPost('login');
        if ($admin) {
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            //error tidak menginput apapun
            if ($username == '' or $password == '') {
                $err = 'SILAHKAN MASUKKAN USERNAME DAN PASSWORD';
            }

            //error jika username tidak terdaftar
            $user = $AdminLogin->where('username', $username)->first();
            if (!$user) {
                $err = 'ADMIN TIDAK TERDAFTAR';
            }

            //error jiak password tidak sesuai
            if (empty($err)) {
                $data = $AdminLogin->where('username', $username)->first();